/*
  Copyright 2009-2010, jimmikaelkael
  Licenced under Academic Free License version 3.0
  Review Open PS2 Loader README & LICENSE files for further details.
*/

#include "smsutils.h"
#include "mass_common.h"
#include "mass_stor.h"
#include "dev9.h"
#include "oplsmb.h"
#include "smb.h"
#include "atad.h"
#include "ioplib_util.h"
#include "cdvdman.h"
#include "internal.h"
#include "cdvd_config.h"
#include "device.h"

#include <loadcore.h>
#include <stdio.h>
#include <sysclib.h>
#include <sysmem.h>
#include <thbase.h>
#include <thevent.h>
#include <intrman.h>
#include <ioman.h>
#include <thsemap.h>
#include <errno.h>
#include <io_common.h>
#include <usbd.h>
#include "ioman_add.h"

/*	Some modules (e.g. SMAP) will check for dev9 and its version number.
	In the interest of maintaining network support of games in HDD mode,
	the module ID of CDVDMAN is changed to DEV9.
	SMB mode will never support network support in games, as the SMAP interface cannot be shared.	*/
#ifdef HDD_DRIVER
#define MODNAME "dev9"
IRX_ID(MODNAME, 2, 8);
#else
#define MODNAME "cdvd_driver"
IRX_ID(MODNAME, 1, 1);
#endif

//------------------ Patch Zone ----------------------
#ifdef HDD_DRIVER
struct cdvdman_settings_hdd cdvdman_settings = {
    {0x69, 0x69,
     0x1234,
     0x39393939,
     "B00BS"},
    0x12345678};
#elif SMB_DRIVER
struct cdvdman_settings_smb cdvdman_settings = {
    {0x69, 0x69,
     0x1234,
     0x39393939,
     "B00BS"},
    "######  FILENAME  ######",
    {{"192.168.0.10",
      0x8510,
      "PS2SMB",
      "",
      "GUEST",
      ""}}};
#elif USB_DRIVER
struct cdvdman_settings_usb cdvdman_settings = {
    {0x69, 0x69,
     0x1234,
     0x39393939,
     "B00BS"},
};
#else
#error Unknown driver type. Please check the Makefile.
#endif

//----------------------------------------------------
extern struct irx_export_table _exp_cdvdman;
extern struct irx_export_table _exp_cdvdstm;
extern struct irx_export_table _exp_smsutils;
extern struct irx_export_table _exp_oplutils;
#ifdef __USE_DEV9
extern struct irx_export_table _exp_dev9;
#endif

struct dirTocEntry
{
    short length;
    u32 fileLBA;         // 2
    u32 fileLBA_bigend;  // 6
    u32 fileSize;        // 10
    u32 fileSize_bigend; // 14
    u8 dateStamp[6];     // 18
    u8 reserved1;        // 24
    u8 fileProperties;   // 25
    u8 reserved2[6];     // 26
    u8 filenameLength;   // 32
    char filename[128];  // 33
} __attribute__((packed));

typedef struct
{
    iop_file_t *f;
    u32 lsn;
    unsigned int filesize;
    unsigned int position;
} FHANDLE;

// internal functions prototypes
static void oplShutdown(int poff);
static void fs_init(void);
static void cdvdman_init(void);
static int cdvdman_readMechaconVersion(char *mname, u32 *stat);
static int cdvdman_readID(int mode, u8 *buf);
static FHANDLE *cdvdman_getfilefreeslot(void);
static void cdvdman_trimspaces(char *str);
static struct dirTocEntry *cdvdman_locatefile(char *name, u32 tocLBA, int tocLength, int layer);
static int cdvdman_findfile(cd_file_t *pcd_file, const char *name, int layer);
static int cdvdman_writeSCmd(u8 cmd, void *in, u32 in_size, void *out, u32 out_size);
static int cdvdman_sendSCmd(u8 cmd, void *in, u32 in_size, void *out, u32 out_size);
static int cdvdman_cb_event(int reason);
static unsigned int event_alarm_cb(void *args);
static void cdvdman_startThreads(void);
