/*
  Copyright 2009-2010, jimmikaelkael
  Licenced under Academic Free License version 3.0
  Review Open PS2 Loader README & LICENSE files for further details.
*/

#include "smsutils.h"
#include "mass_common.h"
#include "mass_stor.h"
#include "dev9.h"
#include "smb.h"
#include "atad.h"
#include "ioplib_util.h"
#include "cdvdman.h"
#include "cdvd_config.h"

#include <loadcore.h>
#include <stdio.h>
#include <sysclib.h>
#include <sysmem.h>
#include <thbase.h>
#include <thevent.h>
#include <intrman.h>
#include <ioman.h>
#include <thsemap.h>
#include <thmsgbx.h>
#include <errno.h>
#include <io_common.h>
#include <usbd.h>
#include <ps2ip.h>
#include "ioman_add.h"

#ifdef __IOPCORE_DEBUG
#define DPRINTF(args...)	printf(args)
#else
#define DPRINTF(args...)	do { } while(0)
#endif

#ifdef HDD_DRIVER
#define MODNAME "dev9"
IRX_ID(MODNAME, 2, 8);
#else
#define MODNAME "cdvd_driver"
IRX_ID(MODNAME, 1, 1);
#endif

//------------------ Patch Zone ----------------------
#ifdef HDD_DRIVER
static struct cdvdman_settings_hdd cdvdman_settings={
	{
		0x69, 0x69,
		0x1234,
		0x39393939,
		"B00BS"
	},
	0x12345678
};
#elif SMB_DRIVER
struct cdvdman_settings_smb cdvdman_settings={
	{
		0x69, 0x69,
		0x1234,
		0x39393939,
		"B00BS"
	},
	"192.168.0.10",
	0x8510,
	"PS2SMB",
	"",
	"GUEST",
	"",
	"######  GAMETITLE SMB  ######",
	0,
	{
		{
			"EXTEN",
			"SLPM_550.52",
		}
	}
};
#elif USB_DRIVER
struct cdvdman_settings_usb cdvdman_settings={
	{
		0x69, 0x69,
		0x1234,
		0x39393939,
		"B00BS"
	},
	{1,2,3,4,5,6,7,8,9,10}
};
#else
	#error Unknown driver type. Please check the Makefile.
#endif

//----------------------------------------------------
struct irx_export_table _exp_cdvdman;
struct irx_export_table _exp_cdvdstm;
#ifdef SMB_DRIVER
struct irx_export_table _exp_dev9;
#endif
#ifdef HDD_DRIVER
struct irx_export_table _exp_dev9;
struct irx_export_table _exp_atad;
#endif
#ifdef USB_DRIVER
#ifdef __USE_DEV9
struct irx_export_table _exp_dev9;
#endif
#endif
struct irx_export_table _exp_smsutils;
#ifdef VMC_DRIVER
struct irx_export_table _exp_oplutils;
#endif

struct dirTocEntry {
	short	length;
	u32	fileLBA;			// 2
	u32	fileLBA_bigend;			// 6
	u32	fileSize;			// 10
	u32	fileSize_bigend;		// 14
	u8	dateStamp[6];			// 18
	u8	reserved1;			// 24
	u8	fileProperties;			// 25
	u8	reserved2[6];			// 26
	u8	filenameLength;			// 32
	char	filename[128];			// 33
} __attribute__((packed));

struct cdvdman_StreamingData{
	unsigned int lsn;
	unsigned int bufmax;
	int stat;
};

typedef struct {
	int err;
	int status;
	struct cdvdman_StreamingData StreamingData;
	int intr_ef;
	int disc_type_reg;
#ifdef ALT_READ_CORE
	int cdNCmd;
	int cddiskready;
#else
	u32 cdread_lba;
	u32 cdread_sectors;
	void *cdread_buf;
	cd_read_mode_t cdread_mode;
#endif
} cdvdman_status_t;

typedef struct {
	iop_file_t *f;
	u32 lsn;
	unsigned int filesize;
	unsigned int position;
} FHANDLE;

// internal functions prototypes
#ifdef USB_DRIVER
static void usbd_init(void);
#endif
#ifdef SMB_DRIVER
static void ps2ip_init(void);
#endif
static void fs_init(void);
static void cdvdman_init(void);
#ifdef ALT_READ_CORE
static void cdvdman_cdinit();
static int cdvdman_ReadSect(u32 lsn, u32 nsectors, void *buf);
#endif
static int cdvdman_readMechaconVersion(char *mname, u32 *stat);
static int cdvdman_readID(int mode, u8 *buf);
