/*
  Copyright 2009-2010, jimmikaelkael
  Licenced under Academic Free License version 3.0
  Review Open PS2 Loader README & LICENSE files for further details.
*/

#include "smsutils.h"
#include "mass_common.h"
#include "mass_stor.h"
#include "dev9.h"
#include "smb.h"
#include "atad.h"
#include "ioplib_util.h"

#include <loadcore.h>
#include <stdio.h>
#include <sysclib.h>
#include <sysmem.h>
#include <thbase.h>
#include <thevent.h>
#include <intrman.h>
#include <ioman.h>
#include <thsemap.h>
#include <thmsgbx.h>
#include <errno.h>
#include <io_common.h>
#include <usbd.h>
#include <ps2ip.h>
#include "ioman_add.h"

#ifdef __IOPCORE_DEBUG
#define DPRINTF(args...)	printf(args)
#else
#define DPRINTF(args...)	do { } while(0)
#endif

#define MODNAME "dev9"
IRX_ID(MODNAME, 2, 8);


//------------------ Patch Zone ----------------------
#ifdef SMB_DRIVER
static char g_ISO_name[] = "######    GAMESETTINGS    ######";
#else
static char g_tag[] = "######    GAMESETTINGS    ######";
#endif
static char g_ISO_parts=0x69;
static char g_ISO_media=0x69;
static char g_gamesetting_alt_read=0;
static int g_gamesetting_disable_DVDDL=0;
static int g_gamesetting_0_pss=0;

#define ISO_MAX_PARTS	16
static int g_part_start[ISO_MAX_PARTS] = {
	0,	// is apa header LBA in HDD use, is Long filename in SMB+ISO
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0
}; 

static char g_DiskID[] = "\0B00BS"; 	// the null byte is here to ensure the ISO name string 

#define CDVDreg_9             (*(volatile unsigned char *)0xBF402008)
#define CDVDreg_STATUS        (*(volatile unsigned char *)0xBF40200A)
#define CDVDreg_B             (*(volatile unsigned char *)0xBF40200B)
#define CDVDreg_C             (*(volatile unsigned char *)0xBF40200C)
#define CDVDreg_D             (*(volatile unsigned char *)0xBF40200D)
#define CDVDreg_E             (*(volatile unsigned char *)0xBF40200E)
#define CDVDreg_TYPE          (*(volatile unsigned char *)0xBF40200F)
#define CDVDreg_13            (*(volatile unsigned char *)0xBF402013)
#define CDVDreg_SCOMMAND      (*(volatile unsigned char *)0xBF402016)
#define CDVDreg_SDATAIN       (*(volatile unsigned char *)0xBF402017)
#define CDVDreg_SDATAOUT      (*(volatile unsigned char *)0xBF402018)
#define CDVDreg_KEYSTATE      (*(volatile unsigned char *)0xBF402038)
#define CDVDreg_KEYXOR        (*(volatile unsigned char *)0xBF402039)
#define CDVDreg_DEC           (*(volatile unsigned char *)0xBF40203A)

// user cb CDVD events 
#define SCECdFuncRead         1
#define SCECdFuncReadCDDA     2
#define SCECdFuncGetToc       3
#define SCECdFuncSeek         4
#define SCECdFuncStandby      5
#define SCECdFuncStop         6
#define SCECdFuncPause        7
#define SCECdFuncBreak        8

// Modes for cdInit()
#define CDVD_INIT_INIT		0x00		// init cd system and wait till commands can be issued
#define CDVD_INIT_NOCHECK	0x01		// init cd system
#define CDVD_INIT_EXIT		0x05		// de-init system

// CDVD stats
#define CDVD_STAT_STOP		0x00		// disc has stopped spinning
#define CDVD_STAT_OPEN		0x01		// tray is open
#define CDVD_STAT_SPIN		0x02		// disc is spinning
#define CDVD_STAT_READ		0x06		// reading from disc
#define CDVD_STAT_PAUSE		0x0A		// disc is paused
#define CDVD_STAT_SEEK		0x12		// disc is seeking
#define CDVD_STAT_ERROR		0x20		// error occurred

// cdTrayReq() values
#define CDVD_TRAY_OPEN		0		// Tray Open
#define CDVD_TRAY_CLOSE		1		// Tray Close
#define CDVD_TRAY_CHECK		2		// Tray Check

// sceCdDiskReady() values
#define CDVD_READY_READY	0x02
#define CDVD_READY_NOTREADY	0x06

#define CdSpinMax		0
#define CdSpinNom		1
#define CdSpinStm		0

// cdGetError() return values
#define CDVD_ERR_FAIL		-1		// error in cdGetError()
#define CDVD_ERR_NO		0x00		// no error occurred
#define CDVD_ERR_ABRT		0x01		// command was aborted due to cdBreak() call
#define CDVD_ERR_CMD		0x10		// unsupported command
#define CDVD_ERR_OPENS		0x11		// tray is open
#define CDVD_ERR_NODISC		0x12		// no disk inserted
#define CDVD_ERR_NORDY		0x13		// drive is busy processing another command
#define CDVD_ERR_CUD		0x14		// command unsupported for disc currently in drive
#define CDVD_ERR_IPI		0x20		// sector address error
#define CDVD_ERR_ILI		0x21		// num sectors error
#define CDVD_ERR_PRM		0x22		// command parameter error
#define CDVD_ERR_READ		0x30		// error while reading
#define CDVD_ERR_TRMOPN		0x31		// tray was opened
#define CDVD_ERR_EOM		0x32		// outermost error
#define CDVD_ERR_READCF		0xFD		// error setting command
#define CDVD_ERR_READCFR  	0xFE		// error setting command

struct dirTocEntry {
	short	length;
	u32	fileLBA;			// 2
	u32	fileLBA_bigend;			// 6
	u32	fileSize;			// 10
	u32	fileSize_bigend;		// 14
	u8	dateStamp[6];			// 18
	u8	reserved1;			// 24
	u8	fileProperties;			// 25
	u8	reserved2[6];			// 26
	u8	filenameLength;			// 32
	char	filename[128];			// 33
} __attribute__((packed));

typedef struct {
	u8 stat;
	u8 second;
	u8 minute;
	u8 hour;
	u8 week;
	u8 day;
	u8 month;
	u8 year;
} cd_clock_t;

typedef struct {
	u32	lsn;
	u32	size;
	char	name[16];
	u8	date[8];
} cd_file_t;

typedef struct {
	u32	lsn;
	u32	size;
	char	name[16];
	u8	date[8];
	u32	flag;
} cdl_file_t;

typedef struct {
	u8 minute;
	u8 second;
	u8 sector;
	u8 track;
} cd_location_t;

typedef struct {
	u8 trycount;
	u8 spindlctrl;
	u8 datapattern;
	u8 pad;
} cd_read_mode_t;

typedef struct {
	int err;
	int status;
	int Ststat;
	int Stbufmax;
	int Stlsn;
	int intr_ef;
	int disc_type_reg;
#ifdef ALT_READ_CORE
	int cdNCmd;
	int cddiskready;
#else		
	u32 cdread_lba;
	u32 cdread_sectors;
	void *cdread_buf;
	cd_read_mode_t cdread_mode;
#endif
} cdvdman_status_t;

typedef struct {
	iop_file_t *f;
	u32 lsn;
	u32 filesize;
	u32 position;
} FHANDLE;

// exported functions prototypes
int sceCdInit(int init_mode);							// #4
