/*
  Copyright 2009-2010, jimmikaelkael
  Licenced under Academic Free License version 3.0
  Review OpenUsbLd README & LICENSE files for further details.
*/

#include <stdio.h>
#include <sysclib.h>
#include <ps2ip.h>
#include <thbase.h>
#include <io_common.h>

#include "smb.h"
#include "auth.h"
#include "poll.h"

#define SMB_MAGIC	0x424d53ff

struct SMBHeader_t {			//size = 36
	u32	sessionHeader;
	u32	Magic;
	u8	Cmd;
	short	Eclass;
	short	Ecode;
	u8	Flags;
	u16	Flags2;
	u8	Extra[12];
	u16	TID;
	u16	PID;
	u16	UID;
	u16	MID;
} __attribute__((packed));

struct SMBTransactionRequest_t {	//size = 28
	u16	TotalParamCount;
	u16	TotalDataCount;
	u16	MaxParamCount;
	u16	MaxDataCount;
	u8	MaxSetupCount;
	u8	Reserved;
	u16	Flags;
	u32	Timeout;
	u16	Reserved2;
	u16	ParamCount;
	u16	ParamOffset;
	u16	DataCount;
	u16	DataOffset;
	u8	SetupCount;
	u8	Reserved3;
} __attribute__((packed));

struct SMBTransactionResponse_t {	//size = 20
	u16	TotalParamCount;
	u16	TotalDataCount;
	u16	Reserved;
	u16	ParamCount;
	u16	ParamOffset;
	u16	ParamDisplacement;
	u16	DataCount;
	u16	DataOffset;
	u16	DataDisplacement;
	u8	SetupCount;
	u8	Reserved2;
} __attribute__((packed));

struct NegociateProtocolRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	ByteCount;		// 37
	u8	DialectFormat;		// 39
	char	DialectName[0];		// 40
} __attribute__((packed));

struct NegociateProtocolResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	DialectIndex;		// 37
	u8	SecurityMode;		// 39
	u16	MaxMpxCount;		// 40
	u16	MaxVC;			// 42
	u32	MaxBufferSize;		// 44
	u32	MaxRawBuffer;		// 48
	u32	SessionKey;		// 52
	u32	Capabilities;		// 56
	s64	SystemTime;		// 60
	u16	ServerTimeZone;		// 68
	u8	KeyLength;		// 70
	u16	ByteCount;		// 71
	u8	ByteField[0];		// 73
} __attribute__((packed));

struct SessionSetupAndXRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	MaxBufferSize;		// 41
	u16	MaxMpxCount;		// 43
	u16	VCNumber;		// 45
	u32	SessionKey;		// 47
	u16	AnsiPasswordLength;	// 51
	u16	UnicodePasswordLength;	// 53
	u32	reserved;		// 55
	u32	Capabilities;		// 59
	u16	ByteCount;		// 63
	u8	ByteField[0];		// 65
} __attribute__((packed));

struct SessionSetupAndXResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	Action;			// 41
	u16	ByteCount;		// 43
} __attribute__((packed));

struct TreeConnectAndXRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	Flags;			// 41
	u16	PasswordLength;		// 43
	u16	ByteCount;		// 45
	u8	ByteField[0];		// 47
} __attribute__((packed));

struct TreeConnectAndXResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	OptionalSupport;	// 41
	u16	ByteCount;		// 43
} __attribute__((packed));

struct TreeDisconnectRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	ByteCount;		// 37
} __attribute__((packed));

struct TreeDisconnectResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	ByteCount;		// 37
} __attribute__((packed));

struct NetShareEnumRequest_t {
	struct SMBHeader_t smbH;			// 0
	u8	smbWordcount;				// 36
	struct SMBTransactionRequest_t smbTrans;	// 37
	u16	ByteCount;				// 65
	u8	ByteField[0];				// 67
} __attribute__((packed));

struct NetShareEnumResponse_t {
	struct SMBHeader_t smbH;			// 0
	u8	smbWordcount;				// 36
	struct SMBTransactionResponse_t smbTrans; 	// 37
	u16	ByteCount;				// 57
	u8	ByteField[0];				// 59
} __attribute__((packed));

struct LogOffAndXRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	ByteCount;		// 41
} __attribute__((packed));

struct LogOffAndXResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	ByteCount;		// 41
} __attribute__((packed));

struct EchoRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	EchoCount;		// 37
	u16	ByteCount;		// 39
	u8	ByteField[0];		// 41
} __attribute__((packed));

struct EchoResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	SequenceNumber;		// 37
	u16	ByteCount;		// 39
	u8	ByteField[0];		// 41
} __attribute__((packed));

struct QueryInformationDiskRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	ByteCount;		// 37
	u8	ByteField[0];		// 39
} __attribute__((packed));

struct QueryInformationDiskResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	TotalUnits;		// 37
	u16	BlocksPerUnit;		// 39
	u16	BlockSize;		// 41
	u16	FreeUnits;		// 43
	u16	Reserved;		// 45
	u16	ByteCount;		// 47
} __attribute__((packed));

struct QueryPathInformationRequestParam_t {
	u16	LevelOfInterest;
	u32	Reserved;
	u8	FileName[0];
} __attribute__((packed));

struct QueryPathInformationRequest_t {
	struct SMBHeader_t smbH;			// 0
	u8	smbWordcount;				// 36
	struct SMBTransactionRequest_t smbTrans;	// 37
	u16	SubCommand;				// 65
	u16	ByteCount;				// 67
	u8	ByteField[0];				// 69
} __attribute__((packed));

struct QueryPathInformationResponse_t {
	struct SMBHeader_t smbH;			// 0
	u8	smbWordcount;				// 36
	struct SMBTransactionResponse_t smbTrans;	// 37
	u16	ByteCount;				// 57
	u8	ByteField[0];				// 59
} __attribute__((packed));

struct BasicFileInfo_t {
	s64 Created;
	s64 LastAccess;
	s64 LastWrite;
	s64 Change;
	u32 FileAttributes;
} __attribute__((packed));

struct StandardFileInfo_t {
	u64 AllocationSize;
	u64 EndOfFile;
	u32 LinkCount;
	u8  DeletePending;
	u8  IsDirectory;
} __attribute__((packed));

struct FindFirst2RequestParam_t {
	u16	SearchAttributes;
	u16	SearchCount;
	u16	Flags;
	u16	LevelOfInterest;
	u32	StorageType;
	u8	SearchPattern[0];
} __attribute__((packed));

struct FindNext2RequestParam_t {
	u16	SearchID;
	u16	SearchCount;
	u16	LevelOfInterest;
	u32	ResumeKey;
	u16	Flags;
	u8	SearchPattern[0];
} __attribute__((packed));

struct FindFirstNext2Request_t {
	struct SMBHeader_t smbH;			// 0
	u8	smbWordcount;				// 36
	struct SMBTransactionRequest_t smbTrans;	// 37
	u16	SubCommand;				// 65
	u16	ByteCount;				// 67
	u8	ByteField[0];				// 69
} __attribute__((packed));

struct FindFirstNext2ResponseParam_t {
	u16	SearchID;
	u16	SearchCount;
	u16	EndOfSearch;
	u16	EAErrorOffset;
	u16	LastNameOffset;
} __attribute__((packed));

struct FindFirst2ResponseData_t {
	u32	NextEntryOffset;
	u32	FileIndex;
	s64	Created;
	s64	LastAccess;
	s64	LastWrite;
	s64	Change;
	u64	EndOfFile;
	u64	AllocationSize;
	u32	FileAttributes;
	u32	FileNameLen;
	u32	EAListLength;
	u16	ShortFileNameLen;
	u8	ShortFileName[24];
	u8	FileName[0];
} __attribute__((packed));
 
struct FindFirstNext2Response_t {
	struct SMBHeader_t smbH;			// 0
	u8	smbWordcount;				// 36
	struct SMBTransactionResponse_t smbTrans; 	// 37
	u16	ByteCount;				// 57
	u8	ByteField[0];				// 59
} __attribute__((packed));

struct NTCreateAndXRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u8	reserved;		// 41
	short	NameLength;		// 42
	u32	Flags;			// 44
	u32	RootDirectoryFid;	// 48
	u32	AccessMask;		// 52
	u64	AllocationSize;		// 56
	u32	FileAttributes;		// 64
	u32	ShareAccess;		// 68
	u32	CreateDisposition;	// 72
	u32	CreateOptions;		// 76
	u32	ImpersonationLevel;	// 80
	u8	SecurityFlags;		// 84
	u16	ByteCount;		// 85
	char	Name[0];		// 87
} __attribute__((packed));

struct NTCreateAndXResponse_t {		// size = 107
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u8	OplockLevel;		// 41
	u16	FID;			// 42
	u32	Action;			// 44
	s64	Created;		// 48
	s64	LastAccess;		// 56
	s64	LastWrite;		// 64
	s64	Changed;		// 72
	u32	FileAttributes;		// 80
	u64	AllocationSize;		// 84
	u64	FileSize;		// 92
	u16	FileType;		// 100
	u16	IPCState;		// 102
	u8	IsDirectory;		// 104
	u16	ByteCount;		// 105
} __attribute__((packed));

struct OpenAndXRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	Flags;			// 41
	u16	AccessMask;		// 43
	u16	SearchAttributes;	// 45
	u16	FileAttributes;		// 47
	u8	Created[4];		// 49
	u16	CreateOptions;		// 53
	u32	AllocationSize;		// 55
	u32	reserved[2];		// 59
	u16	ByteCount;		// 67
	u8	Name[0];		// 69
} __attribute__((packed));

struct OpenAndXResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	FID;			// 41
	u16	FileAttributes;		// 43
	u8	LastWrite[4];		// 45
	u32	FileSize;		// 49
	u16	GrantedAccess;		// 53
	u16	FileType;		// 55
	u16	IPCState;		// 57
	u16	Action;			// 59
	u32	ServerFID;		// 61
	u16	reserved;		// 65
	u16	ByteCount;		// 67
} __attribute__((packed));

struct ReadAndXRequest_t {		// size = 63
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	FID;			// 41
	u32	OffsetLow;		// 43
	u16	MaxCountLow;		// 47
	u16	MinCount;		// 49
	u32	MaxCountHigh;		// 51
	u16	Remaining;		// 55
	u32	OffsetHigh;		// 57
	u16	ByteCount;		// 61
} __attribute__((packed));

struct ReadAndXResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	Remaining;		// 41
	u16	DataCompactionMode;	// 43
	u16	reserved;		// 45
	u16	DataLengthLow;		// 47
	u16	DataOffset;		// 49
	u32	DataLengthHigh;		// 51
	u8	reserved2[6];		// 55
	u16	ByteCount;		// 61
} __attribute__((packed));

struct WriteAndXRequest_t {		// size = 63
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	FID;			// 41
	u32	OffsetLow;		// 43
	u32	Reserved;		// 47
	u16	WriteMode;		// 51
	u16	Remaining;		// 53
	u16	DataLengthHigh;		// 55
	u16	DataLengthLow;		// 57
	u16	DataOffset;		// 59
	u32	OffsetHigh;		// 61
	u16	ByteCount;		// 65
} __attribute__((packed));

struct WriteAndXResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u8	smbAndxCmd;		// 37
	u8	smbAndxReserved;	// 38
	u16	smbAndxOffset;		// 39
	u16	Count;			// 41
	u16	Remaining;		// 43
	u16	CountHigh;		// 45
	u16	Reserved;		// 47
} __attribute__((packed));

struct CloseRequest_t {			// size = 45
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	FID;			// 37
	u32	LastWrite;		// 39
	u16	ByteCount;		// 43
} __attribute__((packed));

struct CloseResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	ByteCount;		// 37
} __attribute__((packed));

struct DeleteRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	SearchAttributes;	// 37
	u16	ByteCount;		// 39
	u8	BufferFormat;		// 41
	u8	FileName[0];		// 42
} __attribute__((packed));

struct DeleteResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	ByteCount;		// 37
} __attribute__((packed));

struct ManageDirectoryRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	ByteCount;		// 37
	u8	BufferFormat;		// 39
	u8	DirectoryName[0];	// 40
} __attribute__((packed));

struct ManageDirectoryResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	ByteCount;		// 37
} __attribute__((packed));

struct RenameRequest_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	SearchAttributes;	// 37
	u16	ByteCount;		// 39
	u8	ByteField[0];		// 41
} __attribute__((packed));

struct RenameResponse_t {
	struct SMBHeader_t smbH;	// 0
	u8	smbWordcount;		// 36
	u16	ByteCount;		// 37
} __attribute__((packed));


static server_specs_t server_specs;

struct ReadAndXRequest_t smb_Read_Request = {
	{	0x3b000000,
		SMB_MAGIC,
		SMB_COM_READ_ANDX,
		0, 0, 0, 0, "\0", 0, 0, 0, 0
	},
	12, 
	SMB_COM_NONE,
	0, 0, 0, 0, 0, 0, 0, 0, 0, 0
};

struct WriteAndXRequest_t smb_Write_Request = {
	{	0,
		SMB_MAGIC,
		SMB_COM_WRITE_ANDX,
		0, 0, 0, 0, "\0", 0, 0, 0, 0
	},
	14, 
	SMB_COM_NONE,
	0, 0, 0, 0, 0, 0x01, 0, 0, 0, 0x3f, 0 	// 0x01 is WriteThrough mode and 0x3f is DataOffset
};

#define LM_AUTH 	0
#define NTLM_AUTH 	1

static int main_socket = -1;

static u8 SMB_buf[MAX_SMB_BUF+1024] __attribute__((aligned(64)));

//-------------------------------------------------------------------------
server_specs_t *getServerSpecs(void)
{
	return &server_specs;
}

//-------------------------------------------------------------------------
