/*
  Copyright 2009, jimmikaelkael
  Licenced under Academic Free License version 3.0
  Review open-ps2-loader README & LICENSE files for further details.
*/

#include <intrman.h>
#include <loadcore.h>
#include <stdio.h>
#include <sifcmd.h>
#include <sifman.h>
#include <sysmem.h>
#include <sysclib.h>
#include <thbase.h>
#include <thsemap.h>

#include "smsutils.h"

#define MODNAME "cdvdfsv"
IRX_ID(MODNAME, 1, 1);

typedef struct {
	u8 stat;
	u8 second;
	u8 minute;
	u8 hour;
	u8 week;
	u8 day;
	u8 month;
	u8 year;
} cd_clock_t;

typedef struct {
	u32	lsn;
	u32	size;
	char	name[16];
	u8	date[8];
} cd_file_t;

typedef struct {
	u32	lsn;
	u32	size;
	char	name[16];
	u8	date[8];
	u32	flag;
} cdl_file_t;

typedef struct {
	u8	trycount;
	u8	spindlctrl;
	u8	datapattern;
	u8	pad;
} cd_read_mode_t;

// cdGetError() return values
#define CDVD_ERR_FAIL		-1		// error in cdGetError()
#define CDVD_ERR_NO		0x00		// no error occurred
#define CDVD_ERR_ABRT		0x01		// command was aborted due to cdBreak() call
#define CDVD_ERR_CMD		0x10		// unsupported command
#define CDVD_ERR_OPENS		0x11		// tray is open
#define CDVD_ERR_NODISC		0x12		// no disk inserted
#define CDVD_ERR_NORDY		0x13		// drive is busy processing another command
#define CDVD_ERR_CUD		0x14		// command unsupported for disc currently in drive
#define CDVD_ERR_IPI		0x20		// sector address error
#define CDVD_ERR_ILI		0x21		// num sectors error
#define CDVD_ERR_PRM		0x22		// command parameter error
#define CDVD_ERR_READ		0x30		// error while reading
#define CDVD_ERR_TRMOPN		0x31		// tray was opened
#define CDVD_ERR_EOM		0x32		// outermost error
#define CDVD_ERR_READCF		0xFD		// error setting command
#define CDVD_ERR_READCFR  	0xFE		// error setting command

// cdvdman imports
int sceCdInit(int init_mode);						// #4
int sceCdStandby(void);							// #5
int sceCdRead(u32 lsn, u32 sectors, void *buf, cd_read_mode_t *mode); 	// #6
int sceCdSeek(u32 lsn);							// #7
int sceCdGetError(void); 						// #8
int sceCdSearchFile(cd_file_t *fp, const char *name); 			// #10
int sceCdSync(int mode); 						// #11
int sceCdGetDiskType(void);						// #12
int sceCdDiskReady(int mode); 						// #13
int sceCdTrayReq(int mode, u32 *traycnt); 				// #14
int sceCdStop(void); 							// #15
int sceCdReadClock(cd_clock_t *rtc); 					// #24
int sceCdStatus(void); 							// #28
int sceCdApplySCmd(int cmd, void *in, u32 in_size, void *out); 		// #29
int sceCdPause(void);							// #38
int sceCdBreak(void);							// #39
int sceCdStInit(u32 bufmax, u32 bankmax, void *iop_bufaddr); 		// #56
int sceCdStRead(u32 sectors, void *buf, u32 mode, u32 *err); 		// #57
int sceCdStSeek(u32 lsn);						// #58
int sceCdStStart(u32 lsn, cd_read_mode_t *mode);			// #59
int sceCdStStat(void); 							// #60
int sceCdStStop(void);							// #61
int sceCdRead0(u32 lsn, u32 sectors, void *buf, cd_read_mode_t *mode);	// #62
int sceCdStPause(void);							// #67
int sceCdStResume(void); 						// #68
int sceCdMmode(int mode); 						// #75
int sceCdStSeekF(u32 lsn); 						// #77
int sceCdReadDiskID(void *DiskID);					// #79
int sceCdReadGUID(void *GUID);						// #80
int sceCdSetTimeout(int param, int timeout);				// #81
int sceCdReadModelID(void *ModelID);					// #82
int sceCdReadDvdDualInfo(int *on_dual, u32 *layer1_start); 		// #83
int sceCdLayerSearchFile(cdl_file_t *fp, const char *name, int layer);	// #84

typedef struct {
	int	func_ret;
	int	cdvdfsv_ver;
	int	cdvdman_ver;
	int	debug_mode;
} cdvdinit_res_t;

typedef struct {
	int	result;
	cd_clock_t rtc;
} cdvdreadclock_res_t;

typedef struct {
	int	result;
	u32	param1;
	u32	param2;
} cdvdSCmd_res_t;

typedef struct {
	u16	cmd;
	u16	in_size;
	void	*in;
} cdapplySCmd_t __attribute__((aligned(64)));

typedef struct {		// size =0x124
	cd_file_t cdfile;	// 0x000
	char	name[256]; 	// 0x020
	void	*dest;		// 0x120
} SearchFilePkt_t;

typedef struct {		// size =0x128
	cdl_file_t cdfile; 	// 0x000
	char	name[256]; 	// 0x024
	void	*dest;		// 0x124
} SearchFilePkt2_t;

typedef struct {		// size =0x12c
	cdl_file_t cdfile; 	// 0x000
	char	name[256]; 	// 0x024
	void	*dest;		// 0x124
	int	layer;		// 0x128
} SearchFilePktl_t;

typedef struct {
	u32	lsn;
	u32	sectors;
	void	*buf;
	cd_read_mode_t mode;
	void	*eeaddr1;
	void	*eeaddr2;
} RpcCdvd_t;

typedef struct {
	u32	lsn;
	u32	sectors;
	void	*buf;
	int	cmd;
	cd_read_mode_t mode;
	u32	pad;
} RpcCdvdStream_t;

typedef struct {
	u32	bufmax;
	u32	bankmax;
	void	*buf;
	u32	pad;
} RpcCdvdStInit_t;

typedef struct {
	u32	lsn;		// sector location to start reading from
	u32	sectors;	// number of sectors to read
	void	*buf;		// buffer address to read to ( bit0: 0=EE, 1=IOP )
} RpcCdvdchain_t;		// (EE addresses must be on 64byte alignment)

typedef struct { // size = 144
	u32	b1len;
	u32	b2len;
	void	*pdst1;
	void	*pdst2;
	u8	buf1[64];
	u8	buf2[64];
} cdvdfsv_readee_t;

// internal prototypes
void init_thread(void *args);
void cdvdfsv_startrpcthreads(void);
void cdvdfsv_rpc0_th(void *args);
void cdvdfsv_rpc1_th(void *args);
void cdvdfsv_rpc2_th(void *args);
void *cbrpc_cdinit(u32 fno, void *buf, int size);
